Revit 2025 API
PreferredJunctionType Enumeration
 Enumerated type representing the possible options for the preferred junction for a routine preference rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PreferredJunctionType
Public Enumeration PreferredJunctionType
public enum class PreferredJunctionType
type PreferredJunctionType
Members
Member name | Value | Description
Tee | 0 |  Tee junction type.
Tap | 1 |  Tap junction type.
See Also
Reference
Autodesk.Revit.DB Namespace